/*
Дадена е еднострана поврзана листа (SLL) со цели броеви. Ваша задача е N број пати
да ја избришете средината (средишниот елемент во листата) на листата. Доколку
листата има парен број елементи, од двата средишни елементи се брише помалиот.
Доколку листата има парен број елементи и двата средишни елементи имаат иста
вредност се брише првиот од нив.

Влез: Во првиот ред е даден бројот на елементи на листата. Во вториот ред се дадени
елементите на листата, одвоени со празно место. Во третиот ред е даден N, број на
пати колку треба да се избрише средината на листата.

Излез: Резултатната листа. Доколку листата е празна испечатете: Prazna lista

Делумно решение: Задачата се смета за делумно решена со најмалку 7 точни тест
примери.

Забелешка: при реализација на задачите не е дозволено да се користат помошни
структури како низи или сл. и не е дозволено менување на вредностите на јазлите во
листата. На располагање од структурите има само ЕДНА еднострано поврзана листа

име на класа (Java): DeleteMiddle
ПРИМЕРИ:
Влез 4->6->8->3->1->3, N=1
Излез 4->6->8->1->3

Влез 4->6->8->3->1->3, N=2
Излез 4->6->1->3

Влез 4->6->8->3->1->3, N=3
Излез 4->6->3
 */

import java.util.Scanner;

public class DeleteMiddle {
    public static void deleteMiddle(SLL<Integer> lista,int n)
    {
        //TODO: your code here
    }
    public static void main(String[] args) {
        Scanner scanner=new Scanner(System.in);
        int n=Integer.parseInt(scanner.nextLine());
        SLL<Integer> lista=new SLL<>();
        String[] input=scanner.nextLine().split(" ");
        for(String number:input)
            lista.insertLast(Integer.parseInt(number));
        n=Integer.parseInt(scanner.nextLine());
        deleteMiddle(lista,n);
        System.out.println("Result: "+lista);
    }
}
